###############################
## R-Ladies თბილისი         ###
###############################


# 1.1. გაიგე რა არის შენი სამუშაო სივრცე
getwd()

# დააყენე ახალი სამუშაო სივრცე
setwd("/Users/MariamAsatiani/Documents/R")

# help() ან ? ფუნქციების გამოყენებით გაარკვიე რისთვის გამოიყენება ეს ფუნქციები paste(); abline(); c()

# 1.2. შექმენი 8 ობიექტი. დაარქვი var0, var1, var2, var3, var4, var5, var6, var7
# ობიექტები უნდა შეიცავდნენ შემდეგ მონაცემებს: 5, 2+2, 4*5, 240/60, 4^15, "this is", "my object", "5"

# 1.3. რა განსხვავებაა var0 და var7-ს შორის? 
#var0 is numeric var7 is a character

# 1.4. შეკრიბე var0 და var3.

# 1.5. Paste-ით დახმარებით შექმენი ახალი ობიექტი "var56" რომელიც გააერთიანებს var5 და var6-ს.

# 1.6. c() ფუნქციის გამოყენებით შექმენი ვექტორი რომელიც შეიცავს შემდეგ ციფრებს: 1,2,3,4. 
#ობიექტს დაარქვი a

# c() ფუნქციის გამოყენებით შექმენი ვექტორი რომელიც შეიცავს შემდეგ ციფრებს: 1,1,1,1. 
#ობიექტს დაარქვი b

# length() ფუნქციის გამოყენებით გაიგე რა არის a ობიექტის სიდიდე.

# მიუმატე a და b ვექტორები და მათი ჯამით შექმენი ახალი ვექტორი c.

# isTRUE() ფუნქციის და == ოპერატორის გამოყენებით, გაიგე ტოლია თუ არა a და b ვექტორები.

# შექმენი ახალი ვექტორი v რომელიც შეიცავს: "hi", "hello", "hola" 

# class() ფუნქციის გამოყენებით, დაადგინე რა არის a და v ვექტორების კლასები

# 1.7. შექმენით მატრიცა
#M1 <- matrix(c(1,1,2,2,3,3), nrow = 2, ncol = 3)

# 1.8. დააინსტალირე და ჩატვირთე შემდეგი პაკეტები: foreign, readr, readstata13.

# 1.9. წაიკითხე ამ პაკეტების შესახებ, რისთვის არიან ისინი?

# 1.10. შეინახე შენი R script.


